scripts/event-and-env-vars/start_workflow/event-provider.json

{
  "body": "<ns0:Envelope xmlns:ns0=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ns1=\"http://soap.sforce.com/2005/09/outbound\" xmlns:ns3=\"urn:sobject.enterprise.soap.sforce.com\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><ns0:Body><ns1:notifications><ns1:OrganizationId>00D2E000000oF5KUAU</ns1:OrganizationId><ns1:ActionId>04kTV000001AjCzYAK</ns1:ActionId><ns1:SessionId>00D2E000000oF5K!AQEAQHCoLv01DjdHxNW2SUpwKDcJxI1BAnTmPG0C0a3BIarD3slQMH23e8TGUPye1OX1BVjfvC6k3p.OkvDBQ8BSwRkLYZiF</ns1:SessionId><ns1:EnterpriseUrl>https://shulman-hill.my.salesforce.com/services/Soap/c/61.0/00D2E000000oF5K</ns1:EnterpriseUrl><ns1:PartnerUrl>https://shulman-hill.my.salesforce.com/services/Soap/u/61.0/00D2E000000oF5K</ns1:PartnerUrl><ns1:Notification><ns1:Id /><ns1:sObject xsi:type=\"sf:Treatment_Custom__c\"><ns3:Id>a32TV000000n0jdYAA</ns3:Id><ns3:File_Info_Id__c>a2VTV000001I4fh2AC</ns3:File_Info_Id__c><ns3:Record_Type_Name__c>Provider</ns3:Record_Type_Name__c></ns1:sObject></ns1:Notification></ns1:notifications></ns0:Body></ns0:Envelope>"
}