src/test/resources/simpleUpdate.json

{
"body" : "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n    <soapenv:Body>\n        <notifications xmlns=\"http://soap.sforce.com/2005/09/outbound\">\n            <OrganizationId>00Dg0000003MgkIEAS</OrganizationId>\n            <ActionId>04kg000000002cuAAA</ActionId>\n            <SessionId xsi:nil=\"true\"/>\n            <EnterpriseUrl>https://cs17.salesforce.com/services/Soap/c/40.0/00Dg0000003MgkI</EnterpriseUrl>\n            <PartnerUrl>https://cs17.salesforce.com/services/Soap/u/40.0/00Dg0000003MgkI</PartnerUrl>\n            <Notification>\n                <Id>04lg000000CHTPlAAP</Id>\n                <sObject xsi:type=\"sf:Contact\" xmlns:sf=\"urn:sobject.enterprise.soap.sforce.com\">\n                    <sf:Id>003g000001VJ7ALAA1</sf:Id>\n                    <sf:Delivery_Information__c>changed the delivery instructions yet again</sf:Delivery_Information__c>\n                    <sf:FirstName>ue8Rla9qeDbBu6mt9Dc</sf:FirstName>\n                    <sf:LastName>ue8Rla9qeDbBu6mt9Dc</sf:LastName>\n                    <sf:MailingStreet>new mailing street</sf:MailingStreet>\n                    <sf:OtherStreet>ue8Rla9qeDbBu6mt9Dc</sf:OtherStreet>\n                </sObject>\n            </Notification>\n        </notifications>\n    </soapenv:Body>\n</soapenv:Envelope>"
}